Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ནམ་མཁའི་ངང་ཚུལ་ཅན་ཞེས་བྱ་བར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: They reveal to beings the Dharma that [all the goals], up to and including all-aspect omniscience, are of the nature of space. “

source: །གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ནི་འགྲོ་བ་མེད་པ་སྟེ། དེ་ནི་མི་འགྲོ་མི་འོང་ངོ་ཞེས་བྱ་བར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: They reveal to beings the Dharma that the emptiness of physical forms is without movement, that is to say, it neither goes nor comes.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་ནི་འགྲོ་བ་མེད་པ་སྟེ། དེ་ནི་མི་འགྲོ་མི་འོང་ངོ་ཞེས་བྱ་བར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: They reveal to beings the Dharma that the emptiness of feelings, perceptions, formative predispositions, and consciousness is without movement, that is to say, it neither goes nor comes.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་སྟོང་པ་ཉིད་ནི་འགྲོ་བ་མེད་པ་སྟེ། དེ་ནི་མི་འགྲོ་མི་འོང་ངོ་ཞེས་བྱ་བར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: They reveal to beings the Dharma that the emptiness of the sense fields, the sensory elements, and the links of dependent origination is without movement, that is to say, it neither goes nor comes.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་སྟོང་པ་ཉིད་ནི་འགྲོ་བ་མེད་པ་སྟེ།
en: They reveal to beings the Dharma that the emptiness of all the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas is without movement, that is to say, it neither goes nor comes.

source: དེ་ནི་མི་འགྲོ་མི་འོང་ངོ་ཞེས་བྱ་བར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་སྟོང་པ་ཉིད་ནི་འགྲོ་བ་མེད་པ་སྟེ། དེ་ནི་མི་འགྲོ་མི་འོང་ངོ་ཞེས་བྱ་བར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: They reveal to beings the Dharma that the emptiness of [all the goals], up to and including all-aspect omniscience, is without movement, that is to say, it neither goes nor comes.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་ལམ་དུ་གྱུར་པ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: It is in this way, Subhūti, that bodhisattva great beings, after attaining consummate buddhahood in unsurpassed, complete enlightenment, become a pathway for beings. “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་ཉིད་ཀྱི་ངང་ཚུལ་ཅན་ཏེ།
en: If you ask why, all phenomena are of the nature of emptiness.

source: དེ་དག་ནི་ངང་ཚུལ་དེ་ལས་མི་འདའོ།
en: They do not transgress this nature.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in emptiness going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of signlessness.

source: དེ་དག་ནི་ངང་ཚུལ་དེ་ལ་ས་མི་འདའོ།
en: They do not transgress this nature.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། མཚན་མ་མེད་པ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in signlessness going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྨོན་པ་མེད་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of wishlessness.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྨོན་པ་མེད་པ་ལ་འགྲོ་བ་འམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in wishlessness going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of nonconditioning.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་འགྲོ་བ་འམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in nonconditioning going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་མི་སྐྱེ་མི་འགག་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of nonarising and nonceasing.

source: དེ་དག་ནི་ངང་ཚུལ་དེ་ལས་མི་འང་འོ།
en: They do not transgress this nature.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། མི་སྐྱེ་མི་འགག་པ་ལ་འགྲོ་བ་འམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in nonarising and nonceasing, going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of nonaffliction and nonpurification.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in nonaffliction and nonpurification, going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་རྨི་ལམ་གྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of dreams.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྨི་ལམ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in dreams going and coming are not apprehended.

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྒྱུ་མའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of magical displays.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྒྱུ་མ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in magical displays going and coming are not apprehended. {

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྒྲ་བརྙན་གྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Ki.IV: 103} Subhūti, all phenomena are of the nature of echoes.

source: དེ་དག་ནི་ངང་ཚུལ་དེ་ལས་མི་མི་འདའོ།
en: They do not transgress this nature.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྒྲ་བརྙན་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in echoes going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་མིག་ཡོར་གྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of optical aberrations.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། མིག་ཡོར་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in optical aberrations going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་གཟུགས་བརྙན་གྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of reflections.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གཟུགས་བརྙན་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in reflections going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྨིག་རྒྱུའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of mirages.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྨིག་རྒྱུ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in mirages going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཆུ་ཟླའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of the moon’s reflection in water.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆུ་ཟླ་ལ་འགྲོ་བ་འམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in the moon’s reflection in water going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྤྲུལ་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of phantom emanations.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྤྲུལ་པ་ལ་ལ་འགྲོ་བ་འམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in phantom emanations going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་མཐའ་ཡས་ཀུན་དུ་མཐའ་ཡས་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena have a nature that is limitless and boundless.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། མཐའ་ཡས་ཀུན་དུ་མཐའ་ཡས་པ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in that which is limitless and boundless, going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་དབྱུང་བ་དང་མི་དབྱུང་བ་མེད་དཔའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena have a nature that is without emancipation and nonemancipation.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དབྱུང་བ་དང་མི་དབྱུང་བ་མེད་པ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in that which is without emancipation and nonemancipation, going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་དབྲི་བ་དང་བསྣན་པ་མེད་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena have a nature that is without subtraction and addition.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དབྲི་བ་དང་བསྣན་པ་མེད་པ་ལ་འགྲོ་བ་འམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in that which is without subtraction and addition, going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་འོང་བ་མེད་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena have a nature that is without coming.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འོང་བ་མེད་པ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in that which is without coming, going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་བླང་བ་དང་དོར་བ་མེད་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena have a nature that is without acceptance and rejection.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བླང་བ་དང་དོར་བ་མེད་པ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in that which is without acceptance and rejection, going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཕྲད་པ་མེད་པ་དང་། འབྲལ་པ་མེད་པ་དང་། འདྲེ་བ་མེད་པ་དང་། མི་འདྲེ་བ་མེད་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena have a nature that is without conjunction, disjunction, embracing, and nonembracing.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཕྲད་པ་མེད་པ་དང་། འབྲལ་བ་མེད་པ་དང་། འདྲེ་བ་མེད་པ་དང་། མི་འདྲེ་བ་མེད་པ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, in that which is without conjunction, disjunction, embracing, and nonembracing, going and coming are not apprehended. “

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་བདག་གི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena have a nature that is without self.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བདག་ཉིད་ཀྱང་ཤིན་ཏུ་མེད་ན་དེ་ལ་འགྲོ་བའམ། འོང་བ་ལྟ་ག་ལ་ཡོད། རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་།
en: If you ask why, Subhūti, in the self, which is itself absolutely nonexistent, how could there be going or coming?

source: སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་།
en: Subhūti, all phenomena have a nature that is without sentient beings, life forms, living creatures, life, individual personalities, human beings, people, actors, agents, petitioners, instigators, experiencers, knowers, or viewers.

source: བྱེད་དུ་འཇུག་པ་པོ་དང་། སློང་བ་པོ་དང་། ཡོངས་སུ་སློང་བ་པོ་དང་། ཚོར་བ་པོ་དང་། ཚོར་བྱེད་པ་པོ་དང་།
en: They do not transgress this nature.

source: ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་ངང་ཚུལ་ཅན་ཏེ། དེ་དག་ནི་ངང་ཚུལ་དེ་ལས་མི་འདའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མཐོང་བ་པོ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in viewers [and so forth], which are themselves absolutely nonexistent, how could there be going or coming? “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་རྟག་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of permanence.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྟག་པ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ཡོད།
en: If you ask why, Subhūti, in permanence, which is itself absolutely nonexistent, how could there be going or coming?

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་བདེ་བ་དང་།
en: Subhūti, all phenomena are of the nature of happiness, self, {Ki.

source: བདག་དང་སྡུག་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: IV: 104} and pleasantness.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྡུག་པ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in pleasantness [and so forth], which are themselves absolutely nonexistent, how could there be going or coming? “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་མི་རྟག་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of impermanence.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མི་རྟག་པ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན། དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in impermanence, which is itself absolutely nonexistent, how could there be going or coming?

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། མི་སྡུག་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of suffering, nonself, and unpleasantness.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མི་སྡུག་པ་ཉིད་ཀྱང་། ཤིན་དུ་མེད་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in unpleasantness [and so forth], which are themselves absolutely nonexistent, how could there be going or coming? “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་འདོད་ཆགས་ཀྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of desire.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འདོད་ཆགས་ཀྱི་དངོས་པོ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན། དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in the entity of desire, which is itself absolutely nonexistent, how could there be going or coming?

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཞེ་སྡང་གི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of hatred.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཞེ་སྡང་གི་དངོས་པོ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in the entity of hatred, which is itself absolutely nonexistent, how could there be going or coming?

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་གཏི་མུག་གི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of delusion.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གཏི་མུག་གི་དངོས་པོ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན། དེ་ལ་འགྲོ་བ་འམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in the entity of delusion, which is itself absolutely nonexistent, how could there be going or coming?

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ལྟ་བའི་རྣམ་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of false views.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ལྟ་བའི་རྣམ་པའི་དངོས་པོ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in the entity of false views, which is itself absolutely nonexistent, how could there be going or coming? “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་དེ་བཞིན་ཉིད་ཀྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of the real nature.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་ཉིད་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, Subhūti, in the real nature going and coming are not apprehended.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་དང་། ཡང་དག་པར་མཐའ་དང་། མཉམ་པ་ཉིད་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of the realm of phenomena, the very limit of reality, sameness, and the inconceivable [expanse].

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, Subhūti, in the inconceivable realm [and so forth], going and coming are not apprehended. “

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་མི་གཡོ་བའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena have a nature that is unmoving.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་གང་ལ་ཡང་གཡོ་བ་མེད་དེ་འགྲོ་བ་འམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, Subhūti, in that which is unmoving, going and coming are not apprehended. “

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་གཟུགས་ཀྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of physical forms.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གཟུགས་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in physical forms, which are themselves absolutely nonexistent, how could there be going or coming?

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of feelings, perceptions, formative predispositions, and consciousness.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in consciousness [and so forth], which are themselves absolutely nonexistent, how could there be going or coming? {

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Ki.IV: 105} “Subhūti, all phenomena are of the nature of the perfection of generosity.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in the perfection of generosity, which is itself absolutely nonexistent, how could there be going or coming?

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ཀྱང་ཤིན་དུ་མེད་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in the perfection of wisdom [and so forth], which are themselves absolutely nonexistent, how could there be going or coming? “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ནང་སྟོང་པ་ཉིད་ཀྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of the emptiness of internal phenomena.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ནང་སྟོང་པ་ཉིད་ཀྱང་ཤིན་ཏུ་མ་དམིགས་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ལ་ཡོད།
en: If you ask why, Subhūti, in the emptiness of internal phenomena, which is itself absolutely not apprehended, how could there be going or coming?

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱང་ཤིན་དུ་མི་དམིགས་ན། དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ལ་ཡོད།
en: If you ask why, Subhūti, in the emptiness of the essential nature of nonentities [and so forth], which are themselves absolutely not apprehended, how could there be going or coming? “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་དྲན་པ་ཉེ་བར་གཞག་པའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of the applications of mindfulness.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དྲན་པ་ཉེ་བར་གཞག་པ་ཉིད་ཀྱང་ཤིན་དུ་མི་དམིགས་ན། དེ་ལ་འགྲོ་བ་འམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in the applications of mindfulness, which are themselves absolutely not apprehended, how could there be going or coming?

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་།
en: Subhūti, all phenomena are of the nature of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the path.

source: ལམ་གྱི་ངང་ཚུལ་ཅན་ཏེ། དེ་དག་ནི་ངང་ཚུལ་དེ་ལས་མི་འདའོ།
en: They do not transgress this nature.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ལམ་ཉིད་ཀྱང་ཤིན་དུ་མི་དམིགས་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད། རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: If you ask why, Subhūti, in the path [and those other causal attributes], which are themselves absolutely not apprehended, how could there be going or coming? “

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: Subhūti, all phenomena are of the nature of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas, They do not transgress this nature.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་ངང་ཚུལ་ཅན་ཏེ། དེ་དག་ནི་ངང་ཚུལ་དེ་ལས་མི་འདའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཉིད་ཀྱང་ཤིན་དུ་མི་དམིགས་ན། དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟག་ལ་ཡོད།
en: If you ask why, Subhūti, in the distinct qualities of the buddhas [and those other fruitional attributes], which are themselves absolutely not apprehended, how could there be going or coming? “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of the fruit of entering the stream to nirvāṇa.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཉིད་ཀྱང་ཤིན་དུ་མི་དམིགས་ན། དེ་ལ་འགྲོ་བ་འམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in the fruit of entering the stream to nirvāṇa, which is itself absolutely not apprehended, how could there be going or coming?

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཀྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment. {

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རང་བྱང་ཆུབ་ཉིད་ཀྱང་ཤིན་དུ་མི་དམིགས་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་ལྟ་ག་ལ་ཡོད།
en: If you ask why, Subhūti, in individual enlightenment [and those other fruits], which are themselves absolutely not apprehended, how could there be going or coming?

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ངང་ཚུལ་ཅན་ཏེ།
en: Subhūti, all phenomena are of the nature of unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཉིད་ཀྱང་ཤིན་ཏུ་མི་དམིགས་ན་དེ་ལ་འགྲོ་བའམ་འོང་བ་མི་དམིགས་སོ།
en: If you ask why, Subhūti, in unsurpassed, complete enlightenment, which is itself absolutely not apprehended, how could there be going or coming?” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་ཟབ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སུ་ཞིག་མོས་པར་འགྱུར།
en: Blessed Lord, who will have conviction in this perfection of wisdom, which is so profound?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྔོན་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་དྲུང་དུ་སྤྱད་པར་གྱུར་པ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པ། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བ། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་མོས་པར་འགྱུར་རོ།
en: Subhūti,” replied the Blessed One, “those bodhisattva great beings who have ripened the roots of virtuous action, practicing in the presence of the lord buddhas of the past for the sake of unsurpassed, complete enlightenment, who have venerated many buddhas, and who have been accepted by a spiritual mentor will have conviction in this profound perfection of wisdom.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་སུམ་ཅུ་དྲུག་པའོ།། །།
en: This completes the thirty-sixth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་མོས་པར་འགྱུར་བ་དེ་དག་གི་རང་བཞིན་ཇི་ལྟ་བུ་ཞིག་ཏུ་འགྱུར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གི་ཚུལ་དང་།
en: Chapter 37 “Blessed Lord, what will be the nature of those bodhisattva great beings who will have conviction in this profound perfection of wisdom?

source: མཚན་མ་དང་། རྣམ་པ་ཇི་ལྟ་བུ་ཞིག་ཏུ་འགྱུར།
en: What will be their indications, signs, and forms?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་མོས་པར་འགྱུར་བ་དེ་དག་ནི་འདོད་ཆགས་རྣམ་པར་བསལ་བས། དབེན་པའི་རང་བཞིན་དུ་འགྱུར་རོ།
en: Subhūti,” replied the Blessed One, “those bodhisattva great beings who will have conviction in this profound perfection of wisdom will have a nature that is isolated, owing to their elimination of desire.
